In [1]:
from pandas import DataFrame

In [2]:
data = {
    "city": ["Paris","Paris","Paris","Paris",
             "London","London","London","London",
             "Rome","Rome","Rome","Rome"],
    "year": [2001,2008,2009,2010,
             2001,2006,2011,2015,
             2001,2006,2009,2012],
    "pop": [2.148,2.211,2.234,2.244,
            7.322,7.657,8.174,8.615,
            2.547,2.627,2.734,2.627]
}

In [3]:
census = DataFrame(data)
census

      city  year    pop
0    Paris  2001  2.148
1    Paris  2008  2.211
2    Paris  2009  2.234
3    Paris  2010  2.244
4   London  2001  7.322
5   London  2006  7.657
6   London  2011  8.174
7   London  2015  8.615
8     Rome  2001  2.547
9     Rome  2006  2.627
10    Rome  2009  2.734
11    Rome  2012  2.627

Display only the first 'n' data points

In [4]:
census.head(5)

     city  year    pop
0   Paris  2001  2.148
1   Paris  2008  2.211
2   Paris  2009  2.234
3   Paris  2010  2.244
4  London  2001  7.322

DataFrames select by column first

census["city"]

In [6]:
census[census["city"] == "Paris"]

    city  year    pop
0  Paris  2001  2.148
1  Paris  2008  2.211
2  Paris  2009  2.234
3  Paris  2010  2.244

Search by row:

In [9]:
census.loc[3] # loc -> location

city    Paris
year     2010
pop     2.244
Name: 3, dtype: object

Add new column

In [10]:
census["continental"] = census["city"] != "London"
census

      city  year    pop  continental
0    Paris  2001  2.148         True
1    Paris  2008  2.211         True
2    Paris  2009  2.234         True
3    Paris  2010  2.244         True
4   London  2001  7.322        False
5   London  2006  7.657        False
6   London  2011  8.174        False
7   London  2015  8.615        False
8     Rome  2001  2.547         True
9     Rome  2006  2.627         True
10    Rome  2009  2.734         True
11    Rome  2012  2.627         True

Delete column:

In [11]:
del census["continental"]
census

      city  year    pop
0    Paris  2001  2.148
1    Paris  2008  2.211
2    Paris  2009  2.234
3    Paris  2010  2.244
4   London  2001  7.322
5   London  2006  7.657
6   London  2011  8.174
7   London  2015  8.615
8     Rome  2001  2.547
9     Rome  2006  2.627
10    Rome  2009  2.734
11    Rome  2012  2.627

In [15]:
pop = census[census["year"] == 2001]["pop"]
pop

0    2.148
4    7.322
8    2.547
Name: pop, dtype: float64

Finding smallest data in column:

In [17]:
pop.min() # just gives minimum value

2.148

In [18]:
pop.idxmin() # gives index of minimum value

0